const arr = ['school', 'table', 2, 4, 5.4, 'museum', 'cat', 'dog'];
console.log(arr)
////////splice//////
// const sp1 = arr.splice(2, 3); починаючи з 2 індекса видаляє 3 улументи
// const sp2 = arr.splice(2, 3, 'chair', 'nose'); починаючи з 2 індекса дидаляє 3 елементи, а натомість вставляє два нові: 'chair', 'nose' 
// const sp3 = arr.splice(2, 0, 999, 888, 777); не видаляє жодного елемента, і починаючи з індекса 2 додає нові елументи, а тих що були пересуває
//////slice///////
// const sl1 = arr.slice(2, 5); // копіює з 2 індекса, по 5 порядковий елемент
// const sl2 = arr.slice(5)// копіює з 5 індукса до кінця
// const sl3 = arr.slice(1,-2); // коп з 1 індуксу до 2 зі заду
// const sl4 = arr.slice(-3)// коп остані 3
